Configure Routers for Syslog, NTP and SSH 
operation
part 1
Step 1:
(for all routers)
line vty 0 4
password vtypa55
login
enable secret enpa55

R1
router ospf 1
network 192.168.1.0 0.0.0.255 area 0
network 10.1.1.0 0.0.0.3 area 0

R2
router ospf 1 
network 10.1.1.0 0.0.0.3 area 0
network 10.2.2.0 0.0.0.3 area 0 

R3
router ospf 1
network 192.168.3.0 0.0.0.255 area 0
network 10.2.2.0 0.0.0.3 area 0 

Step 4: Test Connectivity  
PC-A > ping 192.168.3.5 
Successful 
PC-B > ping 192.168.3.5 
Successful 

Part 1: Configure OSPF MD5 Authentication
R1
router ospf 1 
 area 0 authentication message-digest

R2
 router ospf 1
area 0 authentication message-digest 

R3
router ospf 1 
area 0 authentication message-digest 

Step 3: Configure the MD5 key for all the routers in area 0. Configure an 
MD5 key on the serial interfaces on R1, R2 and R3. Use the password 
MD5pa55 for key 1.

R1
 interface s0/1/0 
 ip ospf message-digest-key 1 md5 MD5pa55

R2
 interface s0/1/0 
 ip ospf message-digest-key 1 md5 MD5pa55 
interface s0/1/1
ip ospf message-digest-key 1 md5 MD5pa55

R3
 interface s0/1/0
 ip ospf message-digest-key 1 md5 MD5pa55 

(for all routers)
R# show ip ospf interface

part 2

Step 1: Enable NTP authentication on PC-A. 
a. 
On PC-A, click NTP under the Services tab to verify NTP service is 
enabled. 
b. 
To configure NTP authentication, click Enable under Authentication. Use 
key 1 and password NTPpa55 
for authentication.

step 2 
R1
ntp server 192.168.1.5
 
R2
ntp server 192.168.1.5

R3
ntp server 192.168.1.5

step 3
R1
ntp update-calendar 
R2
 ntp update-calendar  
R3 
ntp update-calendar 

for all routers
R# show clock

step 4
R1
 ntp authenticate 
ntp trusted-key 1 
 ntp authentication-key 1 md5 NTPpa55

R2
 ntp authenticate 
 ntp trusted-key 1 
 ntp authentication-key 1 md5 NTPpa5

R3
 ntp authenticate 
 ntp trusted-key 1 
 ntp authentication-key 1 md5 NTPpa55 

step 5
R1
service timestamps log datetime msec
R2  
service timestamps log datetime msec 
R3
service timestamps log datetime msec

Part 3: 
R1 -logging host 192.168.1.6 
R2- logging host 192.168.1.6  
R3 -logging host 192.168.1.6

Step 2: Verify logging configuration. 
Use the command  
R# show logging  

Step 3: Examine logs of the Syslog Server. 
From the Services tab of the Syslog Server’s dialogue box, select the Syslog 
services button. Observe the logging messages received from the routers. 


Part 4: Configure R3 to Support SSH Connections

R3- ip domain-name ccnasecurity.com 
username SSHadmin privilege 15 secret sshpa55
line vty 0 4
login local
transport input ssh 
 crypto key zeroize rsa
 crypto key generate rsa
(The name for the keys will be: R3.ccnasecurity.com)
R3
show ip ssh
ip ssh time-out 90
ip ssh authentication-retries 2
 ip ssh version 2 

R3# show ip ssh

Step 8: Attempt to connect to R3 via Telnet from PC-C. 
Open the Desktop of PC-C. Select the Command Prompt icon. From PC-C, 
enter the command to connect to 
R3 via Telnet. 
PC> telnet 192.168.3.1 
This connection should fail because R3 has been configured to accept only SSH 
connections on the virtual terminal lines.
 
Step 9: Connect to R3 using SSH on PC-C. 
Open the Desktop of PC-C. Select the Command Prompt icon. From PC-C, 
enter the command to connect to R3 via SSH. When prompted for the password, 
enter the password configured for the administrator shpa55. 
PC> ssh –l SSHadmin 192.168.3.1 
Password: sshpa55 

Step 10: Connect to R3 using SSH on R2. 
To troubleshoot and maintain R3, the administrator at the ISP must use SSH to 
access the router CLI. From the CLI of R2, enter the command to connect to R3 
via SSH version 2 using the SSHadmin user account. When prompted for the 
password, enter the password configured for the administrator: ciscosshpa55. 
R2# ssh –v 2 –l SSHadmin 10.2.2.1 
Password: sshpa55
